src/figures/kernelTrick-subsidiary.org
#+TITLE: Advanced Machine Learning Subsidary Notes
#+SUBTITLE: Lecture 14: Kernel Trick


* Keywords
  * The Kernel Trick, SVMs, Regression

* Main Points

** Kernels
   * SVM kernels are symmetric functions of two variable that can be
     factorised as an inner-product
     $$  K(\bm{x},\bm{y}) = \bm{\phi}(\bm{x})^\tr\bm{\phi}(\bm{y}) =
     \sum_{i=1}^{p'} \phi_i(\bm{x})\,\phi_i(\bm{y})$$
     - $\bm{\phi}(\bm{x})$ are vectors whose elements,
       $\phi_i(\bm{x})$, are real-valued functions of
       the features $\bm{x}$ (every different feature will correspond
       to a different vector $\bm{\phi}(\bm{x})$)
     - $p'$ is the dimensionality of the extended feature space which
       might be infinite
     - An immediate consequence of this is that the vectors are
       positive semi-definite
       - This follows because for any function $f(\bm{x})$ the
         quadratic form is non-negative 
	 \begin{align*}
	 \int\!\! \int f(\bm{x})\,K(\bm{x},\bm{y}) \, f(\bm{y}) \dd \bm{x}\, \dd \bm{y}
         &= \int\!\! \int f(\bm{x})\, \bm{\phi}(\bm{x})^\tr\bm{\phi}(\bm{y})\, f(\bm{y)}\, \dd \bm{x}\, \dd \bm{y}\\
         &=\sum_{i=1}^{p'}  \left(\int f(\bm{x})\, \phi_i(\bm{x}) \dd
         \bm{x}\right)^2 \geq 0
	 \end{align*}
   * *Eigenfunctions and Mercer's Theorem*
     * Kernel functions play the same role for functions as matrices
       do for normal vectors
       - that is they describe general linear transformations
       - for a function $f(\bm{x})$ the argument $\bm{x}$ can be seen
         as an index just like $i$ is the index of element $v_i$ of a
         vector $\bm{v}$
       - we will consider only symmetric kernels (that is, where
         $K(\bm{x},\bm{y})=K(\bm{y},\bm{x})$
       - these play a similar role as symmetric matrices
     * Eigensystems for Kernels
       - $\psi(\bm{y})$ is said to be an eigenfunction of a kernel
         functions if
	 $$  \int K(\bm{x}, \bm{y})\, \psi(\bm{y}) \, \dd \, \bm{y} =
         \lambda \, \psi(\bm{x}) $$
       - In an analogy to the eigen-decomposition of a symmetric
         matrix we can define the eigen-decomposition of a symmetric
         kernel function
	 $$  K(\bm{x}, \bm{y}) = \sum_i \lambda_i\,
         \psi_i(\bm{x})\,\psi_i(\bm{y}) $$
       - This is known as *Mercer's Theorem*
       - We proved the decomposition for matrices
	 + the difficult part in the proof is that you need the
           eigenvectors to span the vector space
	 + this is intuitively obvious if there are $n$ orthogonal
           eigenvectors in an \(n\)-dimensional space
	 + it is harder in functions spaces and you need to define the
           vector space you are modelling (e.g. $L_2$)
	 + if you assume that the set of eigenvectors span the
           function space then the rest of the proof is the same as
           for matrices
	 + don't worry if you don't understand this it is enough to
           remember Mercer's Theorem
       - Mercer's Theorem holds for any symmetric kernel function (it
         does not have to be positive semi-definite)
       - But if $K(\bm{x},\bm{y})$ are positive semi-define then there
         exist real functions $\phi_i(\bm{x}) = \sqrt{\lambda_i}
         \psi_i(\bm{x})$ such that
	 $$ K(\bm{x}, \bm{y}) &= \sum_i \lambda_i \,
          \psi_i(\bm{x})\,\psi_i(\bm{y}) = \sum_i \phi_i(\bm{x})\,\phi_i(\bm{y}) $$
	 - if $K(\bm{x},\bm{y})$ was not positive semi-definite then
           some of the eigenvalues would be negative and the functions
           $\psi_i(\bm{x})$ would not be real-valued
	
** SVM Kernels
   * SVM Kernels are positive semi-definite symmetric functions
     - There are four necessary and sufficient conditions that hold
       for any positive semi-definite kernel
       1. All their eigenvalues are non-negative (i.e. either zero or positive)
       2. They can be decomposed as
	  $$  K(\bm{x},\bm{y}) = \bm{\phi}(\bm{x})^\tr\bm{\phi}(\bm{y}) =
          \sum_{i=1}^{p'} \phi_i(\bm{x})\,\phi_i(\bm{y})$$
	  where $\phi_i(\bm{x})$ are real-valued functions
       3. Their quadratic form with any function $f(\bm{x})$ is non-negative
       4. For any set of points $\{\bm{x}_1, \bm{x}_2, \ldots,
          \bm{x}_n\}$ the matrix
	  $$ \mat{K} = \begin{pmatrix} K(\bm{x}_1, \bm{x}_1) &
          K(\bm{x}_1, \bm{x}_2) &\cdots &  K(\bm{x}_1, \bm{x}_n) \\
          K(\bm{x}_2, \bm{x}_1) &
          K(\bm{x}_2, \bm{x}_2) &\cdots &  K(\bm{x}_2, \bm{x}_n) \\
	  \vdots & \vdots & \ddots & \vdots \\
          K(\bm{x}_n, \bm{x}_1) &
          K(\bm{x}_n, \bm{x}_2) &\cdots &  K(\bm{x}_n, \bm{x}_n) 
	  \end{pmatrix} $$
	  is a positive semi-definite matrix
	  + such matrices are known as *Gram matrices*
	  + I didn't mention this in the lecture and won't use this
            property, but for completeness I mention it here (you
            won't be tested on it)
	  + the proof that this is a necessary condition follows
            rather simply from the fact that if we define a matrix
            $\mat{\Phi}$ with elements $\Phi_{ik} = \phi_i(\bm{x}_k)$
            then $\mat{K} = \mat{\Phi}^\tr \mat{\Phi}$ and we have
            seen many times any such matrix is positive semi-definite
   * Recall from the previous lecture that any kernel function that
     allows a decomposition in terms of positive functions can be used
     an SVM where we can use the kernel trick
     - If we don't use positive semi-definite kernels then our
       "distances" (used in computing margins) are no-longer proper
       distances and can be negative (invalidating everything)

