src/figures/kernelTrick-subsidiary.tex
% Created 2021-01-28 Thu 17:25
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage[a4paper,margin=20mm]{geometry}
\usepackage{amsmath}
\usepackage{amsfonts}
\usepackage{stmaryrd}
\usepackage{bm}
\usepackage{minted}
\usemintedstyle{emacs}
\usepackage[T1]{fontenc}
\usepackage[scaled]{beraserif}
\usepackage[scaled]{berasans}
\usepackage[scaled]{beramono}
\newcommand{\tr}{\textsf{T}}
\newcommand{\grad}{\bm{\nabla}}
\newcommand{\av}[2][]{\mathbb{E}_{#1\!}\left[ #2 \right]}
\newcommand{\Prob}[2][]{\mathbb{P}_{#1\!}\left[ #2 \right]}
\newcommand{\logg}[1]{\log\!\left( #1 \right)}
\newcommand{\pred}[1]{\left\llbracket { \small #1} \right\rrbracket}
\newcommand{\e}[1]{{\rm e}^{#1}}
\newcommand{\dd}{\mathrm{d}}
\DeclareMathAlphabet{\mat}{OT1}{cmss}{bx}{n}
\newcommand{\normal}[2]{\mathcal{N}\!\left(#1 \big| #2 \right)}
\newcounter{eqCounter}
\setcounter{eqCounter}{0}
\newcommand{\explanation}{\setcounter{eqCounter}{0}\renewcommand{\labelenumi}{(\arabic{enumi})}}
\newcommand{\eq}[1][=]{\stepcounter{eqCounter}\stackrel{\text{\tiny(\arabic{eqCounter})}}{#1}}
\newcommand{\argmax}{\mathop{\mathrm{argmax}}}
\newcommand{\Dist}[2][Binom]{\mathrm{#1}\left( \strut {#2} \right)}
\author{Adam Prügel-Bennett}
\date{\today}
\title{Advanced Machine Learning Subsidary Notes\\\medskip
\large Lecture 14: Kernel Trick}
\hypersetup{
 pdfauthor={Adam Prügel-Bennett},
 pdftitle={Advanced Machine Learning Subsidary Notes},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\maketitle


\section{Keywords}
\label{sec:org1db7803}
\begin{itemize}
\item The Kernel Trick, SVMs, Regression
\end{itemize}

\section{Main Points}
\label{sec:org5d2f1df}

\subsection{Kernels}
\label{sec:org2bafab7}
\begin{itemize}
\item SVM kernels are symmetric functions of two variable that can be
factorised as an inner-product
$$  K(\bm{x},\bm{y}) = \bm{\phi}(\bm{x})^\tr\bm{\phi}(\bm{y}) =
     \sum_{i=1}^{p'} \phi_i(\bm{x})\,\phi_i(\bm{y})$$
\begin{itemize}
\item \(\bm{\phi}(\bm{x})\) are vectors whose elements,
\(\phi_i(\bm{x})\), are real-valued functions of
the features \(\bm{x}\) (every different feature will correspond
to a different vector \(\bm{\phi}(\bm{x})\))
\item \(p'\) is the dimensionality of the extended feature space which
might be infinite
\item An immediate consequence of this is that the vectors are
positive semi-definite
\begin{itemize}
\item This follows because for any function \(f(\bm{x})\) the
quadratic form is non-negative 
\begin{align*}
\int\!\! \int f(\bm{x})\,K(\bm{x},\bm{y}) \, f(\bm{y}) \dd \bm{x}\, \dd \bm{y}
&= \int\!\! \int f(\bm{x})\, \bm{\phi}(\bm{x})^\tr\bm{\phi}(\bm{y})\, f(\bm{y)}\, \dd \bm{x}\, \dd \bm{y}\\
&=\sum_{i=1}^{p'}  \left(\int f(\bm{x})\, \phi_i(\bm{x}) \dd
\bm{x}\right)^2 \geq 0
\end{align*}
\end{itemize}
\end{itemize}
\item \textbf{Eigenfunctions and Mercer's Theorem}
\begin{itemize}
\item Kernel functions play the same role for functions as matrices
do for normal vectors
\begin{itemize}
\item that is they describe general linear transformations
\item for a function \(f(\bm{x})\) the argument \(\bm{x}\) can be seen
as an index just like \(i\) is the index of element \(v_i\) of a
vector \(\bm{v}\)
\item we will consider only symmetric kernels (that is, where
\(K(\bm{x},\bm{y})=K(\bm{y},\bm{x})\)
\item these play a similar role as symmetric matrices
\end{itemize}
\item Eigensystems for Kernels
\begin{itemize}
\item \(\psi(\bm{y})\) is said to be an eigenfunction of a kernel
functions if
$$  \int K(\bm{x}, \bm{y})\, \psi(\bm{y}) \, \dd \, \bm{y} =
         \lambda \, \psi(\bm{x}) $$
\item In an analogy to the eigen-decomposition of a symmetric
matrix we can define the eigen-decomposition of a symmetric
kernel function
$$  K(\bm{x}, \bm{y}) = \sum_i \lambda_i\,
         \psi_i(\bm{x})\,\psi_i(\bm{y}) $$
\item This is known as \textbf{Mercer's Theorem}
\item We proved the decomposition for matrices
\begin{itemize}
\item the difficult part in the proof is that you need the
eigenvectors to span the vector space
\item this is intuitively obvious if there are \(n\) orthogonal
eigenvectors in an \(n\)-dimensional space
\item it is harder in functions spaces and you need to define the
vector space you are modelling (e.g. \(L_2\))
\item if you assume that the set of eigenvectors span the
function space then the rest of the proof is the same as
for matrices
\item don't worry if you don't understand this it is enough to
remember Mercer's Theorem
\end{itemize}
\item Mercer's Theorem holds for any symmetric kernel function (it
does not have to be positive semi-definite)
\item But if \(K(\bm{x},\bm{y})\) are positive semi-define then there
exist real functions \(\phi_i(\bm{x}) = \sqrt{\lambda_i}
         \psi_i(\bm{x})\) such that
$$ K(\bm{x}, \bm{y}) &= \sum_i \lambda_i \,
          \psi_i(\bm{x})\,\psi_i(\bm{y}) = \sum_i \phi_i(\bm{x})\,\phi_i(\bm{y}) $$
\begin{itemize}
\item if \(K(\bm{x},\bm{y})\) was not positive semi-definite then
some of the eigenvalues would be negative and the functions
\(\psi_i(\bm{x})\) would not be real-valued
\end{itemize}
\end{itemize}
\end{itemize}
\end{itemize}

\subsection{SVM Kernels}
\label{sec:org3a7ead6}
\begin{itemize}
\item SVM Kernels are positive semi-definite symmetric functions
\begin{itemize}
\item There are four necessary and sufficient conditions that hold
for any positive semi-definite kernel
\begin{enumerate}
\item All their eigenvalues are non-negative (i.e. either zero or positive)
\item They can be decomposed as
$$  K(\bm{x},\bm{y}) = \bm{\phi}(\bm{x})^\tr\bm{\phi}(\bm{y}) =
          \sum_{i=1}^{p'} \phi_i(\bm{x})\,\phi_i(\bm{y})$$
where \(\phi_i(\bm{x})\) are real-valued functions
\item Their quadratic form with any function \(f(\bm{x})\) is non-negative
\item For any set of points \(\{\bm{x}_1, \bm{x}_2, \ldots,
          \bm{x}_n\}\) the matrix
$$ \mat{K} = \begin{pmatrix} K(\bm{x}_1, \bm{x}_1) &
          K(\bm{x}_1, \bm{x}_2) &\cdots &  K(\bm{x}_1, \bm{x}_n) \\
          K(\bm{x}_2, \bm{x}_1) &
          K(\bm{x}_2, \bm{x}_2) &\cdots &  K(\bm{x}_2, \bm{x}_n) \\
	  \vdots & \vdots & \ddots & \vdots \\
          K(\bm{x}_n, \bm{x}_1) &
          K(\bm{x}_n, \bm{x}_2) &\cdots &  K(\bm{x}_n, \bm{x}_n) 
	  \end{pmatrix} $$
is a positive semi-definite matrix
\begin{itemize}
\item such matrices are known as \textbf{Gram matrices}
\item I didn't mention this in the lecture and won't use this
property, but for completeness I mention it here (you
won't be tested on it)
\item the proof that this is a necessary condition follows
rather simply from the fact that if we define a matrix
\(\mat{\Phi}\) with elements \(\Phi_{ik} = \phi_i(\bm{x}_k)\)
then \(\mat{K} = \mat{\Phi}^\tr \mat{\Phi}\) and we have
seen many times any such matrix is positive semi-definite
\end{itemize}
\end{enumerate}
\end{itemize}
\item Recall from the previous lecture that any kernel function that
allows a decomposition in terms of positive functions can be used
an SVM where we can use the kernel trick
\begin{itemize}
\item If we don't use positive semi-definite kernels then our
"distances" (used in computing margins) are no-longer proper
distances and can be negative (invalidating everything)
\end{itemize}
\end{itemize}
