src/figures/kernelTrick-subsidiary.org
** Constructing SVM Kernel
   * Most functions of two variable won't be positive semi-definite
   * Given a function of two variables it is hard to determine if it
     is positive-semi definite (none of the definitions are
     particularly easy to use)
   * However we can use simple rules to build positive-semi definite (PSD)
     kernels from other positive semi-definite kernels
     1. Our starting point is to note the inner produce $\langle \bm{x},
	\bm{y} \rangle = \bm{x}^\tr \bm{y}$ is positive semi-definite
	- as an aside we don't necessarily need to use normal vectors as
	  our features so long as we objects with an inner-product
     2. Adding PSD kernels\\
	/if $K_1(\bm{x},\bm{y})$ and $K_2(\bm{x}, \bm{y})$ are PSD kernels then so is $K_3(\bm{x}, \bm{y}) = K_1(\bm{x}, \bm{y}) + K_2(\bm{x}, \bm{y})$/
	- To prove this we can use the property that PSD have
	  non-negative quadratic form
	  \begin{align*}
	  Q &= \int f(\bm{x})\, K_3(\bm{x}, \bm{y}) \, f(\bm{y})
           \, \dd \bm{x}  \, \dd \bm{y} \\
           &=\int f(\bm{x})\, \left( \strut K_1(\bm{x}, \bm{y}) + K_2(\bm{x},
           \bm{y}) \right)  f(\bm{y}) \, \dd \bm{x}  \, \dd \bm{y} \\
           &=\int f(\bm{x})\, K_1(\bm{x}, \bm{y}) \, f(\bm{y}) \, \dd \bm{x}  \, \dd \bm{y} +
           \int f(\bm{x})\, K_2(\bm{x}, \bm{y}) \, f(\bm{y}) \, \dd \bm{x}  \, \dd \bm{y}
           \geq 0
           \end{align*}
     3. Multiplication by a positive scalar\\
	/if $K_1(\bm{x},\bm{y})$ is a PSD kernels and $c>0$ then so is $K_3(\bm{x}, \bm{y}) = c\,K_1(\bm{x},,\bm{y})$/
	- We can prove this in a similar way to the last proof
     4. Multiply PSD kernels\\
	/if $K_1(\bm{x},\bm{y})$ and $K_2(\bm{x}, \bm{y})$ are PSD kernels then so is $K_3(\bm{x}, \bm{y}) = K_1(\bm{x}, \bm{y}) \,K_2(\bm{x}, \bm{y})$/
	- This is easy to prove using the decomposition of PSD to
           inner products
	   \begin{align*}
            K_3(\bm{x}, \bm{y})
            = \sum_{i,j} \phi_i^1(\bm{x})\,\phi_i^1(\bm{y})\,
                 \phi_j^2(\bm{x})\,\phi_j^2(\bm{y}) \pause
            = \sum_{i,j} \phi_{ij}^3(\bm{x})\,\phi_{ij}^3(\bm{y})
            \end{align*}
	    where $\phi_{ij}^3(\bm{x}) = \phi_i^1(\bm{x})\,\phi_j^2(\bm{x})$
	  + this (double) sum we can treat as an inner-product
	  + if is easy to show that the quadratic form with any
            function $f(\bm{x})$ is non-negative
     5. Powers of PSD kernels\\
	/if $K_1(\bm{x},\bm{y})$ is a PSD kernels then so is $K_1^n(\bm{x},\bm{y})$ for any natural number $n$/
	- Since the product of any two PSD kernels are PSD then the
          square of a PSD kernel is PSD
	- But by an inductive argument this holds for any integer power
     6. Exponentiial of PSD kernels\\
	/The exponential of a PSD kernel is also a PSD kernel/
	- convergent Taylor expansions allow us to approximate a
          function to any degree of accuracy
	- often Taylor expansions aren't everywhere convergent (so we
          have to be careful
	- but Taylor expansions of exponentials are everywhere convergent
	- further Taylor expanding an exponential of a PSD kernel
          involves a sum of PSD kernels
	  $$\e{K(\bm{x}, \bm{y})} = \sum_i \frac{1}{i!} K^i(\bm{x}, \bm{y})
          = 1 + K(\bm{x}, \bm{y}) + \frac{1}{2} K^2(\bm{x}, \bm{y}) +
           \cdots $$
	  - each term is a PSD kernel
   * Using these properties we see that $K(\bm{x}, \bm{y}) =
     \e{-\gamm\,(\bm{x}-\bm{y})^2} is a PSD kernel if $\gamma>0$
     - Since
       $$ \e{-\gamm\,(\bm{x}-\bm{y})^2} =
       \e{-\gamma\,\|\bm{x}|^2}\,\e{2\,\gamma\,\bm{x}^\tr \bm{y}} \,
       \e{-\gamma\,\|\bm{y}|^2} $$
     - But $\e{-\gamma\,\|\bm{x}|^2}$ and $\e{-\gamma\,\|\bm{y}|^2}$
       are just positive constants
     - $\,\bm{x}^\tr \bm{y}$ is and inner product so a PSD kernel
     - Since $2\,\gamma>0$ then $2\,\gamma\,\bm{x}^\tr \bm{y}$ is a
       PSD kernel
     - But then so is $\e{2\,\gamma\,\bm{x}^\tr \bm{y}}$
     - This kernel is known as the /radial basis function/ or /RBF/ or
       /Gaussian kernel/
     - It has a hyper-parameter, $\gamma$ that determines the length
       scale in the problem (or rather inverse-length scale)
     - this is a very important kernel as it often (but certainly not
       always) gives good performance (if $\gamma$ is appropriately chosen)
   * *Non-numerical Kernels*
     - When SVMs were fashionable there was a whole industry of
       researchers finding clever kernels
     - When working with language or trees or graphs it paid to create
       bespoke kernels for these structures
     - Typically these would all be built up from inner-products
     - Using clever algorithms you can build very clever kernels
       functions
     - One down side of SVM kernels is they don't naturally capture
       prior knowledge about the problem being tackled
       + a clever work around is to build SVMs based on other learning
         machines that are trained the problem
       + an example of this is the use of /Fisher kernels/ based on
         Fisher information

** Beyond SVMs
   * There are a lot of other kernel based learning machines
   * Many of these use constraints
   * They often involve linear operations between vectors where the
     optimum depends on the inner-product of vectors
     - thus we can use the kernel trick
   * /SVR/ are support vector machines for regression
     - here we try to find a dividing plane so that all points lie
       within a margin (the exact opposite of what we had)
     - We can introduce slack variables to allow some points to lie
       outside the margin
       + the slack variables much be non-negative
       + we can use a linear punishment $s_i$ or quadratic punishment $s_i^2$
   * We can also do /kernel  ridge regression/
     $$ \min_{\bm{w}} \lambda\,\| \bm{w} \|^2 + \sum_i \left( y_i -
      \bm{w}^\tr \bm{\phi}(\bm{x_i}) \right)^2 $$
     - $\| \bm{w} \|^2$ is a regularisation term
     - The weights must lie in the space spanned by the set of extended
       feature vectors $\{\bm{\phi}(\bm{x}_k) | k=1,2,\ldots,m\}$
     - Thus we can write
       $$ \bm{w} = \sum_i \alpha_i \,\bm{\phi}(\bm{x}_i) $$
       + Note that here $\alpha_i$ are just parameters; they are not
         Lagrange multipliers and they can be negative
     - Substituting this into the objective function for ridge
       regression we get a quadratic optimisation problem in
       $\bm{\alpha}$ that just depends on the inner products
       $\bm{\phi}^\tr(\bm{x}_i)\,\bm{\phi}(\bm{x}_j)$
     - We can use the kernel trick
   * /Kernel PCA/
     - For kernel PCA we map features into an external feature space
     - We then use the dual form of PCA (which we've done in an
       earlier lecture)
     - This allows us to find non-linear manifolds where the data varies
   * /Kernel Canonical Correlation Analysis/
     - Canonical correlation analysis finds correlations between datasets
     - The linear form is a bit naff
     - But the kernel form can give nice results
   * /Gaussian Processes/
     - Gaussian Processes also use kernels
     - They are a bit different to other kernel methods
       + we don't think of the working in an extended feature space
       + but they are PSD
     - They are one of the most successful methods for doing
       regression
     - We will look at them later

* Exercises

