src/figures/kernelTrick-subsidiary.tex

\subsection{Constructing SVM Kernel}
\label{sec:org724c5d5}
\begin{itemize}
\item Most functions of two variable won't be positive semi-definite
\item Given a function of two variables it is hard to determine if it
is positive-semi definite (none of the definitions are
particularly easy to use)
\item However we can use simple rules to build positive-semi definite (PSD)
kernels from other positive semi-definite kernels
\begin{enumerate}
\item Our starting point is to note the inner produce \(\langle \bm{x},
	\bm{y} \rangle = \bm{x}^\tr \bm{y}\) is positive semi-definite
\begin{itemize}
\item as an aside we don't necessarily need to use normal vectors as
our features so long as we objects with an inner-product
\end{itemize}
\item Adding PSD kernels\\
\emph{if \(K_1(\bm{x},\bm{y})\) and \(K_2(\bm{x}, \bm{y})\) are PSD kernels then so is \(K_3(\bm{x}, \bm{y}) = K_1(\bm{x}, \bm{y}) + K_2(\bm{x}, \bm{y})\)}
\begin{itemize}
\item To prove this we can use the property that PSD have
non-negative quadratic form
\begin{align*}
Q &= \int f(\bm{x})\, K_3(\bm{x}, \bm{y}) \, f(\bm{y})
 \, \dd \bm{x}  \, \dd \bm{y} \\
 &=\int f(\bm{x})\, \left( \strut K_1(\bm{x}, \bm{y}) + K_2(\bm{x},
 \bm{y}) \right)  f(\bm{y}) \, \dd \bm{x}  \, \dd \bm{y} \\
 &=\int f(\bm{x})\, K_1(\bm{x}, \bm{y}) \, f(\bm{y}) \, \dd \bm{x}  \, \dd \bm{y} +
 \int f(\bm{x})\, K_2(\bm{x}, \bm{y}) \, f(\bm{y}) \, \dd \bm{x}  \, \dd \bm{y}
 \geq 0
 \end{align*}
\end{itemize}
\item Multiplication by a positive scalar\\
\emph{if \(K_1(\bm{x},\bm{y})\) is a PSD kernels and \(c>0\) then so is \(K_3(\bm{x}, \bm{y}) = c\,K_1(\bm{x},,\bm{y})\)}
\begin{itemize}
\item We can prove this in a similar way to the last proof
\end{itemize}
\item Multiply PSD kernels\\
\emph{if \(K_1(\bm{x},\bm{y})\) and \(K_2(\bm{x}, \bm{y})\) are PSD kernels then so is \(K_3(\bm{x}, \bm{y}) = K_1(\bm{x}, \bm{y}) \,K_2(\bm{x}, \bm{y})\)}
\begin{itemize}
\item This is easy to prove using the decomposition of PSD to
inner products
\begin{align*}
 K_3(\bm{x}, \bm{y})
 = \sum_{i,j} \phi_i^1(\bm{x})\,\phi_i^1(\bm{y})\,
      \phi_j^2(\bm{x})\,\phi_j^2(\bm{y}) \pause
 = \sum_{i,j} \phi_{ij}^3(\bm{x})\,\phi_{ij}^3(\bm{y})
 \end{align*}
where \(\phi_{ij}^3(\bm{x}) = \phi_i^1(\bm{x})\,\phi_j^2(\bm{x})\)
\begin{itemize}
\item this (double) sum we can treat as an inner-product
\item if is easy to show that the quadratic form with any
function \(f(\bm{x})\) is non-negative
\end{itemize}
\end{itemize}
\item Powers of PSD kernels\\
\emph{if \(K_1(\bm{x},\bm{y})\) is a PSD kernels then so is \(K_1^n(\bm{x},\bm{y})\) for any natural number \(n\)}
\begin{itemize}
\item Since the product of any two PSD kernels are PSD then the
square of a PSD kernel is PSD
\item But by an inductive argument this holds for any integer power
\end{itemize}
\item Exponentiial of PSD kernels\\
\emph{The exponential of a PSD kernel is also a PSD kernel}
\begin{itemize}
\item convergent Taylor expansions allow us to approximate a
function to any degree of accuracy
\item often Taylor expansions aren't everywhere convergent (so we
have to be careful
\item but Taylor expansions of exponentials are everywhere convergent
\item further Taylor expanding an exponential of a PSD kernel
involves a sum of PSD kernels
$$\e{K(\bm{x}, \bm{y})} = \sum_i \frac{1}{i!} K^i(\bm{x}, \bm{y})
          = 1 + K(\bm{x}, \bm{y}) + \frac{1}{2} K^2(\bm{x}, \bm{y}) +
           \cdots $$
\begin{itemize}
\item each term is a PSD kernel
\end{itemize}
\end{itemize}
\end{enumerate}
\item Using these properties we see that \$K(\bm{x}, \bm{y}) =
\e\{-\gamm$\backslash$,(\bm{x}-\bm{y})\(^{\text{2}}\)\} is a PSD kernel if \(\gamma>0\)
\begin{itemize}
\item Since
$$ \e{-\gamm\,(\bm{x}-\bm{y})^2} =
       \e{-\gamma\,\|\bm{x}|^2}\,\e{2\,\gamma\,\bm{x}^\tr \bm{y}} \,
       \e{-\gamma\,\|\bm{y}|^2} $$
\item But \(\e{-\gamma\,\|\bm{x}|^2}\) and \(\e{-\gamma\,\|\bm{y}|^2}\)
are just positive constants
\item \(\,\bm{x}^\tr \bm{y}\) is and inner product so a PSD kernel
\item Since \(2\,\gamma>0\) then \(2\,\gamma\,\bm{x}^\tr \bm{y}\) is a
PSD kernel
\item But then so is \(\e{2\,\gamma\,\bm{x}^\tr \bm{y}}\)
\item This kernel is known as the \emph{radial basis function} or \emph{RBF} or
\emph{Gaussian kernel}
\item It has a hyper-parameter, \(\gamma\) that determines the length
scale in the problem (or rather inverse-length scale)
\item this is a very important kernel as it often (but certainly not
always) gives good performance (if \(\gamma\) is appropriately chosen)
\end{itemize}
\item \textbf{Non-numerical Kernels}
\begin{itemize}
\item When SVMs were fashionable there was a whole industry of
researchers finding clever kernels
\item When working with language or trees or graphs it paid to create
bespoke kernels for these structures
\item Typically these would all be built up from inner-products
\item Using clever algorithms you can build very clever kernels
functions
\item One down side of SVM kernels is they don't naturally capture
prior knowledge about the problem being tackled
\begin{itemize}
\item a clever work around is to build SVMs based on other learning
machines that are trained the problem
\item an example of this is the use of \emph{Fisher kernels} based on
Fisher information
\end{itemize}
\end{itemize}
\end{itemize}

\subsection{Beyond SVMs}
\label{sec:org0d4b6b5}
\begin{itemize}
\item There are a lot of other kernel based learning machines
\item Many of these use constraints
\item They often involve linear operations between vectors where the
optimum depends on the inner-product of vectors
\begin{itemize}
\item thus we can use the kernel trick
\end{itemize}
\item \emph{SVR} are support vector machines for regression
\begin{itemize}
\item here we try to find a dividing plane so that all points lie
within a margin (the exact opposite of what we had)
\item We can introduce slack variables to allow some points to lie
outside the margin
\begin{itemize}
\item the slack variables much be non-negative
\item we can use a linear punishment \(s_i\) or quadratic punishment \(s_i^2\)
\end{itemize}
\end{itemize}
\item We can also do \emph{kernel  ridge regression}
$$ \min_{\bm{w}} \lambda\,\| \bm{w} \|^2 + \sum_i \left( y_i -
      \bm{w}^\tr \bm{\phi}(\bm{x_i}) \right)^2 $$
\begin{itemize}
\item \(\| \bm{w} \|^2\) is a regularisation term
\item The weights must lie in the space spanned by the set of extended
feature vectors \(\{\bm{\phi}(\bm{x}_k) | k=1,2,\ldots,m\}\)
\item Thus we can write
$$ \bm{w} = \sum_i \alpha_i \,\bm{\phi}(\bm{x}_i) $$
\begin{itemize}
\item Note that here \(\alpha_i\) are just parameters; they are not
Lagrange multipliers and they can be negative
\end{itemize}
\item Substituting this into the objective function for ridge
regression we get a quadratic optimisation problem in
\(\bm{\alpha}\) that just depends on the inner products
\(\bm{\phi}^\tr(\bm{x}_i)\,\bm{\phi}(\bm{x}_j)\)
\item We can use the kernel trick
\end{itemize}
\item \emph{Kernel PCA}
\begin{itemize}
\item For kernel PCA we map features into an external feature space
\item We then use the dual form of PCA (which we've done in an
earlier lecture)
\item This allows us to find non-linear manifolds where the data varies
\end{itemize}
\item \emph{Kernel Canonical Correlation Analysis}
\begin{itemize}
\item Canonical correlation analysis finds correlations between datasets
\item The linear form is a bit naff
\item But the kernel form can give nice results
\end{itemize}
\item \emph{Gaussian Processes}
\begin{itemize}
\item Gaussian Processes also use kernels
\item They are a bit different to other kernel methods
\begin{itemize}
\item we don't think of the working in an extended feature space
\item but they are PSD
\end{itemize}
\item They are one of the most successful methods for doing
regression
\item We will look at them later
\end{itemize}
\end{itemize}
