src/figures/kernelTrick-subsidiary.org
** Quadratic Kernels
   * Show that the kernel function $K(\bm{x},\bm{y}) =
      \bm{\phi}^\tr(\bm{x}) \,\bm{\phi}(\bm{y})$, where
     $$ \bm{\phi}(\bm{x}) = (x_1^2, x_2^2, x_3^2, \sqrt{2}\, x_1 x_2,
      \sqrt{2}\,x_1x_3, \sqrt{2}\,x_2x_3) $$
      can be written as
      $(\bm{x}^\tr\bm{y})^2$ is $\bm{x}$ and $\bm{y}$ are vectors of
      length 3.
   * Answer below
 
** Kernel Ridge Regression 
   * Work out the details for kernel ridge regression
   * Have a go at implementing kernel ridge regression on a real data set
   * I'll leave you to work this out

* Experiments

** Gram Matrix
   * Generate ten random vectors $(\bm{x}_1,\bm{x}_2, \ldots,
     \bm{x}_{10})$ where $\bm{x}_k \in \mathbb{R}^5$
   * Compute the Gram matrix $\mat{K}$ with components
     $$ K_{kl} = K(\bm{x}_k,\bm{x}_l) = \e{-\|\bm{x}_k-\bm{x}_l\|^2} $$
   * Show that $\mat{K}$ is positive definite by computing its
     eigenvalues
#+BEGIN_SRC matlab
n = 10;
X=randn(n,5);                 % matrix of vectors
K = zeros(n,n);                % define holder for Gram
for i = 1:n
  x = X(i,:);
  for j = 1:n
    y = X(j,:);
    K(i,j) = exp(-norm(x-y)^2); % define elements of Gram matrix
  endfor
endfor

K            % Gram matrix
eig(K)     % Eigenvalues should all be non-negative
#+END_SRC

* Answers

** Quadratic Kernel
   * This is just straightforward algebra
     \begin{align*}
        \bm{\phi}^\tr(\bm{x}) \bm{\phi}(\bm{y}) &= x_1^2 y_1^2 + x_2^2
        y_2^2 + x_3^2 y_3^2 + 2 x_1 x_2 y_1 y_2 + 2 \,x_1x_3y_1y_3
     + 2 x_2x_3y_2y_3 \\
       &= (x_1 y_1 + x_2 y_2 +x_3 y_2)^2 = (\bm{x}^\tr\bm{y})^2
     \end{align*}
   * In the lecture notes we did the 2-d case
   * Note that the more general polynomial kernel is
     $$ K_p(\bm{x},\bm{y})  = (1+\bm{x}^\tr \bm{y})^p $$
     - this is more commonly used as it incorporates the lower
       dimensional polynomial kernels

* COMMENT [[file:kernelTrick.pdf][PDF]] [[file:pdf/kernelTrick_prn.pdf][print]]
* COMMENT [[file:svm-subsidiary.org][Previous]] [[file:wasserstein-subsidiary.org][Next]]

* Options                                                  :ARCHIVE:noexport:
#+BEGIN_OPTIONS
#+OPTIONS: toc:nil
#+LATEX_HEADER: \usepackage[a4paper,margin=20mm]{geometry}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{amsfonts}
#+LATEX_HEADER: \usepackage{stmaryrd}
#+LATEX_HEADER: \usepackage{bm}
#+LaTeX_HEADER: \usepackage{minted}
#+LaTeX_HEADER: \usemintedstyle{emacs}
#+LaTeX_HEADER: \usepackage[T1]{fontenc}
#+LaTeX_HEADER: \usepackage[scaled]{beraserif}
#+LaTeX_HEADER: \usepackage[scaled]{berasans}
#+LaTeX_HEADER: \usepackage[scaled]{beramono}
#+LATEX_HEADER: \newcommand{\tr}{\textsf{T}}
#+LATEX_HEADER: \newcommand{\grad}{\bm{\nabla}}
#+LATEX_HEADER: \newcommand{\av}[2][]{\mathbb{E}_{#1\!}\left[ #2 \right]}
#+LATEX_HEADER: \newcommand{\Prob}[2][]{\mathbb{P}_{#1\!}\left[ #2 \right]}
#+LATEX_HEADER: \newcommand{\logg}[1]{\log\!\left( #1 \right)}
#+LATEX_HEADER: \newcommand{\pred}[1]{\left\llbracket { \small #1} \right\rrbracket}
#+LATEX_HEADER: \newcommand{\e}[1]{{\rm e}^{#1}}
#+LATEX_HEADER: \newcommand{\dd}{\mathrm{d}}
#+LATEX_HEADER: \DeclareMathAlphabet{\mat}{OT1}{cmss}{bx}{n}
#+LATEX_HEADER: \newcommand{\normal}[2]{\mathcal{N}\!\left(#1 \big| #2 \right)}
#+LATEX_HEADER: \newcounter{eqCounter}
#+LATEX_HEADER: \setcounter{eqCounter}{0}
#+LATEX_HEADER: \newcommand{\explanation}{\setcounter{eqCounter}{0}\renewcommand{\labelenumi}{(\arabic{enumi})}}
#+LATEX_HEADER: \newcommand{\eq}[1][=]{\stepcounter{eqCounter}\stackrel{\text{\tiny(\arabic{eqCounter})}}{#1}}
#+LATEX_HEADER: \newcommand{\argmax}{\mathop{\mathrm{argmax}}}
#+LATEX_HEADER: \newcommand{\Dist}[2][Binom]{\mathrm{#1}\left( \strut {#2} \right)}
#+END_OPTIONS

