src/figures/kernelTrick-subsidiary.tex

\section{Exercises}
\label{sec:org22b82f9}

\subsection{Quadratic Kernels}
\label{sec:org7ee03f3}
\begin{itemize}
\item Show that the kernel function \(K(\bm{x},\bm{y}) =
      \bm{\phi}^\tr(\bm{x}) \,\bm{\phi}(\bm{y})\), where
$$ \bm{\phi}(\bm{x}) = (x_1^2, x_2^2, x_3^2, \sqrt{2}\, x_1 x_2,
      \sqrt{2}\,x_1x_3, \sqrt{2}\,x_2x_3) $$
 can be written as
 \((\bm{x}^\tr\bm{y})^2\) is \(\bm{x}\) and \(\bm{y}\) are vectors of
 length 3.
\item Answer below
\end{itemize}

\subsection{Kernel Ridge Regression}
\label{sec:org3d018d0}
\begin{itemize}
\item Work out the details for kernel ridge regression
\item Have a go at implementing kernel ridge regression on a real data set
\item I'll leave you to work this out
\end{itemize}

\section{Experiments}
\label{sec:org13a65d8}

\subsection{Gram Matrix}
\label{sec:org65672f5}
\begin{itemize}
\item Generate ten random vectors \((\bm{x}_1,\bm{x}_2, \ldots,
     \bm{x}_{10})\) where \(\bm{x}_k \in \mathbb{R}^5\)
\item Compute the Gram matrix \(\mat{K}\) with components
$$ K_{kl} = K(\bm{x}_k,\bm{x}_l) = \e{-\|\bm{x}_k-\bm{x}_l\|^2} $$
\item Show that \(\mat{K}\) is positive definite by computing its
eigenvalues
\end{itemize}
\begin{minted}[]{matlab}
n = 10;
X=randn(n,5);                 % matrix of vectors
K = zeros(n,n);                % define holder for Gram
for i = 1:n
  x = X(i,:);
  for j = 1:n
    y = X(j,:);
    K(i,j) = exp(-norm(x-y)^2); % define elements of Gram matrix
  endfor
endfor

K            % Gram matrix
eig(K)     % Eigenvalues should all be non-negative
\end{minted}

\section{Answers}
\label{sec:org7aa8700}

\subsection{Quadratic Kernel}
\label{sec:org61b2618}
\begin{itemize}
\item This is just straightforward algebra
\begin{align*}
   \bm{\phi}^\tr(\bm{x}) \bm{\phi}(\bm{y}) &= x_1^2 y_1^2 + x_2^2
   y_2^2 + x_3^2 y_3^2 + 2 x_1 x_2 y_1 y_2 + 2 \,x_1x_3y_1y_3
+ 2 x_2x_3y_2y_3 \\
  &= (x_1 y_1 + x_2 y_2 +x_3 y_2)^2 = (\bm{x}^\tr\bm{y})^2
\end{align*}
\item In the lecture notes we did the 2-d case
\item Note that the more general polynomial kernel is
$$ K_p(\bm{x},\bm{y})  = (1+\bm{x}^\tr \bm{y})^p $$
\begin{itemize}
\item this is more commonly used as it incorporates the lower
dimensional polynomial kernels
\end{itemize}
\end{itemize}
\end{document}
